In [28]:
#create dataframe from dict/list
import pandas as pd
data={'Name':['Tom','Jack','Steve','Ricky'],'Age':[28,34,29,42]}
df=pd.DataFrame(data)
#By default the index for rows is 0,1,2,....
#df=pd.DataFrame(data,index=['rank1','rank2','rank3','rank4'])
print(df)

print("----------------------------------------------------------------------")

#add column salary
df['Salary']=pd.Series([2300,4000,6000,3000])
print(df)
print("----------------------------------------------------------------------")

#add row
df=df.append({'Name':'Bob','Age':22,'Salary':2100},ignore_index=True)
print(df)

print("----------------------------------------------------------------------")
print("Dataframe Information:")
print(df.info())
print("----------------------------------------------------------------------")

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42
----------------------------------------------------------------------
    Name  Age  Salary
0    Tom   28    2300
1   Jack   34    4000
2  Steve   29    6000
3  Ricky   42    3000
----------------------------------------------------------------------
    Name  Age  Salary
0    Tom   28    2300
1   Jack   34    4000
2  Steve   29    6000
3  Ricky   42    3000
4    Bob   22    2100
----------------------------------------------------------------------
Dataframe Information:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
Name      5 non-null object
Age       5 non-null int64
Salary    5 non-null int64
dtypes: int64(2), object(1)
memory usage: 164.0+ bytes
None
----------------------------------------------------------------------

In [11]:
print("Below is describe")
#details about each column in data frame 
print(df.describe())

Below is describe
             Age       Salary
count   5.000000     5.000000
mean   31.000000  3480.000000
std     7.483315  1592.796283
min    22.000000  2100.000000
25%    28.000000  2300.000000
50%    29.000000  3000.000000
75%    34.000000  4000.000000
max    42.000000  6000.000000

In [12]:
# select row based on integer index0,1,2
print(df.iloc[2])

Name      Steve
Age          29
Salary     6000
Name: 2, dtype: object

In [13]:
print(df.iloc[1])

Name      Jack
Age         34
Salary    4000
Name: 1, dtype: object

In [17]:
#select row with index label
#df.loc['rank4']

In [18]:
#select column age
print(df['Age'])

0    28
1    34
2    29
3    42
4    22
Name: Age, dtype: int64

In [19]:
df[2:4]

    Name  Age  Salary
2  Steve   29     NaN
3  Ricky   42     NaN

In [20]:
print("Describe Age",df['Age'].describe())

Describe Age count     5.000000
mean     31.000000
std       7.483315
min      22.000000
25%      28.000000
50%      29.000000
75%      34.000000
max      42.000000
Name: Age, dtype: float64

In [21]:
print("Sum of age:",df['Age'].sum())

Sum of age: 155

In [22]:
# delete column
#using del function
#del df['Salary']

In [23]:
#using pop function
#df.pop('Age')

0    28
1    34
2    29
3    42
4    22
Name: Age, dtype: int64

In [29]:
#drop using the row index 1
#df=df.drop(columns=['Age','Salary'])
print(df)

    Name  Age  Salary
0    Tom   28    2300
1   Jack   34    4000
2  Steve   29    6000
3  Ricky   42    3000
4    Bob   22    2100

In [30]:
#select row Age greater than 30
print(df[df.Age>30])

    Name  Age  Salary
1   Jack   34    4000
3  Ricky   42    3000

In [31]:
# Reshaping the Data
print(df)

    Name  Age  Salary
0    Tom   28    2300
1   Jack   34    4000
2  Steve   29    6000
3  Ricky   42    3000
4    Bob   22    2100
   variable  value
0      Name    Tom
1      Name   Jack
2      Name  Steve
3      Name  Ricky
4      Name    Bob
5       Age     28
6       Age     34
7       Age     29
8       Age     42
9       Age     22
10   Salary   2300
11   Salary   4000
12   Salary   6000
13   Salary   3000
14   Salary   2100
    Name  Age  Salary
3  Ricky   42    3000
1   Jack   34    4000
2  Steve   29    6000
0    Tom   28    2300
4    Bob   22    2100
    Name  Age   Sal
0    Tom   28  2300
1   Jack   34  4000
2  Steve   29  6000
3  Ricky   42  3000
4    Bob   22  2100

In [32]:
print(pd.melt(df))

   variable  value
0      Name    Tom
1      Name   Jack
2      Name  Steve
3      Name  Ricky
4      Name    Bob
5       Age     28
6       Age     34
7       Age     29
8       Age     42
9       Age     22
10   Salary   2300
11   Salary   4000
12   Salary   6000
13   Salary   3000
14   Salary   2100

In [38]:
print(df.sort_values('Age',ascending=True))

    Name  Age  Salary
4    Bob   22    2100
0    Tom   28    2300
2  Steve   29    6000
1   Jack   34    4000
3  Ricky   42    3000

In [37]:

print(df.rename(columns={'Salary':'Sal'}))
#print(df.rename(columns={'Salary':'Sal','Name':'N'}))

    Name  Age   Sal
0    Tom   28  2300
1   Jack   34  4000
2  Steve   29  6000
3  Ricky   42  3000
4    Bob   22  2100

In [42]:
# Creating data frame from combining lists
#The inintial set of baby names and births


names=['Bob','Jessica','Mary','John','Mel']
birth=[968,155,77,578,973]
#create data tuples
data_tuples=list(zip(names,birth))
#create dataframe from tuple
print(type(data_tuples))
df=pd.DataFrame(data=data_tuples,columns=['Names','Births'])
print(type(df))
print(df)
#sum of rows
print('Sum of Birth Column:',df['Births'].sum())
#mean of rows
print('Mean of Birth Column:',df['Births'].mean())

<class 'list'>
<class 'pandas.core.frame.DataFrame'>
     Names  Births
0      Bob     968
1  Jessica     155
2     Mary      77
3     John     578
4      Mel     973
Sum of Birth Column: 2751
Mean of Birth Column: 550.2

In [43]:
#write df to csv file with header
df.to_csv("births880.csv",index=False,header=True)

In [68]:
#WARNING change the file before reading
#read csv file
#Location =r'C:\\Data\birth2.csv
df1=pd.read_csv("births880.csv")
print(df1)
df1.info()

     Names  Births
0      Bob   968.0
1  Jessica   155.0
2     Mary    77.0
3     John   578.0
4      Mel   973.0
5    Pappu     NaN
6      NaN   350.0
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
Names     6 non-null object
Births    6 non-null float64
dtypes: float64(1), object(1)
memory usage: 148.0+ bytes

In [47]:
#To find the most popular name or the baby name with the higest birth rate
#sort the dataframe and select the top row
#use the max() attribute to find the maximum value

# Method 1:
Sorted=df1.sort_values(['Births'],ascending=False)
#first two elements
print(Sorted.head(2))

#Method 2:
df1['Births'].max()

  Names  Births
4   Mel   973.0
0   Bob   968.0

973.0

In [49]:
#find no of birth for Name Mary
print(df1)
df1['Births'][df1['Names']=='Mary']

     Names  Births
0      Bob   968.0
1  Jessica   155.0
2     Mary    77.0
3     John   578.0
4      Mel   973.0
5    Pappu     NaN
6      NaN   350.0

2    77.0
Name: Births, dtype: float64

In [51]:
#what is the average no.of births
#calculate manually
df1['Births'].mean()

516.8333333333334

In [66]:
#Extract rows with null values
print(df1)

     Names  Births
0      Bob   968.0
1  Jessica   155.0
2     Mary    77.0
3     John   578.0
4      Mel   973.0
5    Pappu   444.0
6    Rahul   350.0

In [65]:
#check if any NaN values in data frame
print(df1.isnull().values.any())
#check NaN in columns
nan_rows=df1[df1['Names'].isnull()]
nan_rows

False

Empty DataFrame
Columns: [Names, Births]
Index: []

In [63]:
#df1['Births'].fillna(444,inplace=True)
df1

     Names  Births
0      Bob   968.0
1  Jessica   155.0
2     Mary    77.0
3     John   578.0
4      Mel   973.0
5    Pappu   444.0
6    Rahul   350.0

In [62]:
#df1['Names'].fillna('Rahul',inplace=True)
print(df1)

     Names  Births
0      Bob   968.0
1  Jessica   155.0
2     Mary    77.0
3     John   578.0
4      Mel   973.0
5    Pappu   444.0
6    Rahul   350.0

In [69]:
#method ffill for forward fill
#limit will restrict the replacement
df1['Names'].fillna(method='ffill',limit=1,inplace=True)
print(df1)

     Names  Births
0      Bob   968.0
1  Jessica   155.0
2     Mary    77.0
3     John   578.0
4      Mel   973.0
5    Pappu     NaN
6    Pappu   350.0

In [82]:
#understand data set
import pandas as pd
df=pd.read_csv("nyc_weather.csv")
#display no. of rows=shape[0] and columns[1]
print(df.dtypes)
#Display column name and datatype
print(df.shape)
df.head(5)
df.tail(5)
#DISPLAY COLUMN NAMES
print(list(df))
print(df.columns.tolist)
df.count()
#stats of all the columns
df.describe()
#Describe only one column
df['Humidity'].describe()

EST                      object
Temperature               int64
DewPoint                  int64
Humidity                  int64
Sea Level PressureIn    float64
VisibilityMiles           int64
WindSpeedMPH            float64
PrecipitationIn          object
CloudCover                int64
Events                   object
WindDirDegrees            int64
dtype: object
(31, 11)
['EST', 'Temperature', 'DewPoint', 'Humidity', 'Sea Level PressureIn', 'VisibilityMiles', 'WindSpeedMPH', 'PrecipitationIn', 'CloudCover', 'Events', 'WindDirDegrees']
<bound method IndexOpsMixin.tolist of Index(['EST', 'Temperature', 'DewPoint', 'Humidity', 'Sea Level PressureIn',
       'VisibilityMiles', 'WindSpeedMPH', 'PrecipitationIn', 'CloudCover',
       'Events', 'WindDirDegrees'],
      dtype='object')>

count    31.000000
mean     51.677419
std      11.634395
min      33.000000
25%      44.500000
50%      50.000000
75%      55.000000
max      78.000000
Name: Humidity, dtype: float64

In [83]:
#print(df)
type(df['Events'])

pandas.core.series.Series

In [85]:
#change event to categorical
df['Events']=df.Events.astype('category')

In [84]:
type(df['Events'])

pandas.core.series.Series

In [86]:
print(df.dtypes)

EST                       object
Temperature                int64
DewPoint                   int64
Humidity                   int64
Sea Level PressureIn     float64
VisibilityMiles            int64
WindSpeedMPH             float64
PrecipitationIn           object
CloudCover                 int64
Events                  category
WindDirDegrees             int64
dtype: object

In [99]:
#subsetting of data frame
#To select rows whose column values is in list
my_list=[1952,2007]
#To select rows whose values are in range
my_range=range(70,80)
#b=df.Humidity.isin(my_range) #this return boolean
b=df.Humidity.isin(my_list)
#use boolen value for subsetting
#subsetting entire df based on column value
new_df=df[df.Humidity == 44]
#new_df
#subsetting column based on value in other col
x1=df['Temperature'][df['Humidity']==70]
#x1
df_no_NA=df[df.Humidity.notnull()]
#df_no_NA

In [100]:
df.iloc[0:3,3:6]

   Humidity  Sea Level PressureIn  VisibilityMiles
0        52                 30.03               10
1        46                 30.02               10
2        47                 29.86               10

In [103]:
df.loc[[0,3],:]

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345

In [107]:
df=pd.DataFrame({'Animal':['Falcon','Falcon','Parrot','Parrot'], 'Max Speed':[380.,370.,24.,26.]})
print(df)
print(df['Animal'].value_counts())# count of animals
print(df.groupby(['Animal']).sum())
print(df.groupby(['Animal']).mean())

   Animal  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0
Falcon    2
Parrot    2
Name: Animal, dtype: int64
        Max Speed
Animal
Falcon      750.0
Parrot       50.0
        Max Speed
Animal
Falcon      375.0
Parrot       25.0

In [110]:
df_gr=df.groupby('Animal')
print(df_gr['Animal','Max Speed'].max())

        Animal  Max Speed
Animal
Falcon  Falcon      380.0
Parrot  Parrot       26.0

In [113]:
df_gr['Animal'].value_counts()

Animal  Animal
Falcon  Falcon    2
Parrot  Parrot    2
Name: Animal, dtype: int64